var count = 0;
 var btn = document.querySelector(".btn");
 btn.addEventListener("click", generate);
function generate () {
    var quotes = {
        "Проектирам върху другия чертите, които най-силно отхвърлям в себе си" : "Да се обичаме с отворени очи - Хорхе Букай",
        "Когато осъзная, че нещо в другия ме дразни, изследвам как то ме дразни в самия мен." : "Да се обичаме с отворени очи - Хорхе Букай",
        "Избери работа, която обичаш и няма да ти се наложи да работиш нито ден." : "Конфуций",
        "Денят е такъв, какъвто си го направите! Затова защо не го направите великолепен?" : "Стив Шулте",
        "Всеки път, когато сутрин отворя очи, си казвам: Аз, а не обстоятелствата, имам силата да се направя щастлив или нещастен днес. Мога да избера едната от двете възможности." : "Гручо Маркс",
        "Оцелявам, защото огънят в мен е по-силен от този около мен" : "Неизвестен",
        "Всичко е трудно преди да стане лесно." : " Й. В. Гьоте ",
        "Как се пише любов? – попита Прасчо. – Тя не се пише, тя се чувства… – отвърна Пух." : "Мечо Пух - Алън Милн",
        "Наградите и наказанията са най-низшата форма на обучение." : "Чуанг Цу",
        "Най-голямата грешка в любовта е да предложиш сърцето си на този, който има нужда от мозък" : "Д.Гинева",
        "Понякога най-малките неща заемат най-голямо място в сърцето ти" : "МечоПух",
        "Не бива да стоиш сам в гората и да чакаш някой да дойде при теб. Понякога ти сам трябва да отидеш при останалите." : "Мечо Пух",
        "Плевелите също са цветя, щом ги опознаеш." : "Мечо Пух",

        
    }
    
    count +=1;
    
    var disable = document.getElementById("disable");
    if (count >= 3) {
    
        btn.disabled = true;
         disable.style.display="block";
     }
    var keys = Object.keys(quotes);
    var author = keys[Math.floor(Math.random() * keys.length)];
    var quote = quotes[author];

    document.getElementById("quote").innerHTML =  quote;
    document.getElementById("author").innerHTML = author;
}

