import React from 'react';
import Image from 'react-image-webp';
import Header from './Header';
import Footer from './Footer';
import Runner from '../images/runner.jpg';
import One from '../images/01.jpg';
import { Container, Row, Col } from 'react-bootstrap';
import App from './../App.css';

class HowStayHealthy extends React.Component {
  render() {
    return <Container fluid>
      <Header />
      <Row>
        <Col md={{ span: 12 }}>
          <img src={Runner} alt="runner" style={{ width: '100%' }} />
        </Col>
      </Row>
      <Row>
        <Col md={{ span: 4, offset: 4 }} className="py-5">
          <h1 className="text-center pb-5">Как да останем здрави?</h1>
        </Col>
      </Row>
      <Row className="pt-3">
        <Col md={{span:3, offset:2}}>
          <img src={One} alt="one" style={{width:'100%'}}/>
          <h2 className="py-3 title-red">Как имунната Ви система се променя с възрастта</h2>
          <p>С остаряването Вашата имунна система се променя. Възможността й да идентифицира вируси може да намалее
           и Вие ще произвеждате по-малко бели кръвни клетки, които могат да се борят с тях.
           Това ще доведе до повишен риск от вирусни заболявания като грип например.
           Някои учени предполагат, че при остаряване умерените физически упражнения може да засилят
           способността на организма да се бори с бактериалните инфекции.
         Важно е също с възрастта да получавате достатъчно енергия, витамини и елементи като цинк с храната.</p>
        </Col>
        <Col md={{span:3}}>
          <Image webp={require("../images/02.webp")} style={{width:'100%'}}/>
          <h2 className="py-3 title-red">Вашата имунна система получава ли достатъчно „zzzzzzzz“?</h2>
          <p>Недостатъчният сън може действително да засегне имунната Ви система. Ако не спите достатъчно, вероятността да се простудите, да се заразите с хванете вирус или да се чувствате отпаднали е по-голяма.
             Така че придобийте добри навици. Опитайте се да си лягате по едно и също време всяка вечер
              и да се събуждате по едно и също време всяка сутрин – дори и през почивните дни.
              Счита се, че 7-8 часа сън са идеални. Добрите навици за сън
          ще Ви помогнат да се чувствате отпочинали и да поддържате имунната си система здрава.</p>
        </Col>
        <Col md={{span:3}}>
          <Image webp={require("../images/03.webp")} style={{width:'100%'}}/>
          <h2 className="py-3 title-red">Защитете се от замърсена околна среда</h2>
          <p>Вашата имунна система често се повлиява от околната среда. Това включва въздухът, който дишате,
             местата, където се разхождате, и водата, която пиете. Когато белите дробове, червата
             или кожата влязат в контакт с някои замърсители от околната среда, Вашата имунна система
             трябва да работи усилено, за да се пребори с тях. Трудно е да се избегнат ежедневните замърсители
             като напр. емисиите от превозните средства или замърсената вода,
             които могат да повишат възприемчивостта на организма Ви към болести.
         Но като поддържате силна имунна система, това може да Ви помогне да не се разболявате.</p>
        </Col>
      </Row>
      <Row>
        <Col md={{span:5, offset:2}}>
          <Image webp={require("../images/04.webp")} style={{width:'100%'}}/>
        </Col>
        <Col md={{span:3}}>
          <h3 className="title-red">Три страхотни факта за белите кръвни клетки</h3>
          <p><strong>Белите кръвни клетки</strong> са като персонални бодигардове на Вашата имунна система,
      чиято работа е да се бори с инфекциите и рака.  <br />В една капка кръв <strong>има 7 000 - 25 000 </strong> бели кръвни клетки.<br />
            <strong>Някога поглеждали ли сте към светлината</strong> и виждали ли сте криволичещи точки да се движат пред очите Ви?
       Това са белите кръвни клетки, движещи се в капилярите пред ретината на очите Ви.</p>
        </Col>
      </Row>
      <Row className="py-3">
        <Col md={{span:3, offset:2}}>
          <Image webp={require("../images/travel@2x.webp")} style={{width:'100%'}}/>
          <h3 className="py-3 title-red">Пътуването може да бъде предизвикателство за имунната Ви система</h3>
          <p>Когато пътувате в чужбина, Вашата имунна система се сблъсква с нови
             бактерии и вируси. За да избегнете заболяване, опитайте се да вземате пре- и пробиотици.
              По-голямата част от имунната Ви система е разположена в червата, така че подсилването
               на „добрите“ бактерии означава, че „лошите“ бактерии не могат да се развият.
                Добре е също да сте сигурни, че имунната Ви система получава всички микроелементи,
                 от които се нуждае, за да функционира правилно. И винаги е добра идея да имате
               в багажа си бутилка с антисептик за ръце, за да поддържате добра хигиена.</p>
        </Col>
        <Col md={{span:3}}>
          <Image webp={require("../images/allergy@2x.webp")} style={{width:'100%'}}/>
          <h3 className="py-3 title-red">Алергия или лъжлива тревога?</h3>
          <p>Алергиите може да са мъчителни, но повечето се предизвикват от реакцията на имунната
             Ви система към „лъжлива тревога“. Прахта и обикновените полени обичайно са безобидни,
              но ако Вие сте алергични към тях, Вашата имунна система ще реагира драматично.
               Вашите антитела ще атакуват  вследствие на което, ще се появят водниста хрема,
             сълзящи очи или други досадни симптоми.</p>
        </Col>
        <Col md={{span:3}}>
          <Image webp={require("../images/immune@2x.webp")} style={{width:'100%'}}/>
          <h3 className="py-3 title-red">Защо имунната Ви система иска да сте щастливи</h3>
          <p>Знаете ли, че колкото по-оптимистично сте настроени, толкова по-вероятно е имунната
             Ви система да бъде силна? Така че опитвайте се да поддържате близки лични връзки,
              за да помогнете за намаляване на отрицателните емоции и стреса. Слушането на музика
               и релаксирането може да повиши доброто Ви физическо състояние, а един масаж може
             да намали тревожността, като едновременно подпомага имунната Ви система.</p>
        </Col>

      </Row>
      <Row>
        <Col md={{span:5, offset:2}} style={{padding:0}}>
          <Image webp={require("../images/redoxon-hand-image.webp")} />
          </Col>
          <Col md={{span:4}}>
          <h3 className="title-red p-4">Да бъдете здрави през цялата година</h3>
          <p className="pl-4">Според скорошно проучване на Университета на Кембридж, нашата имунна система се повлиява
              от сезоните. Това обяснява защо е по-вероятно да се разболеем през зимата. Няколко дни
              на зимно слънце биха могли да Ви помогнат да се почувствате по-добре, въпреки че
                специалистите препоръчват също и физически упражнения, добро хранене и топло облекло,
                  които ще помогнат на имунната Ви система да се бори със сезонните болести.</p>
        </Col>
      </Row>
      <Row className="py-3">
        <Col md={{span:3, offset:2}}>
          <Image webp={require("../images/cold-virus@2x.webp")} style={{width:'100%'}}/>
          <h3 className="title-red py-4">Четири лесни начина да спрете разпространението на простудните заболявания във Вашето семейство</h3>
          <ol>
            <li>Мийте си ръцете – около 80% от инфекциозните заболявания се разпространяват при допир.
       Микробите попадат по ръцете Ви и след това в очите и устата.</li>
            <li>Използвайте кърпичка, когато кашляте или кихате.
            След това я хвърлете в кошчето за боклук. По този начин микробите няма да се полепят
       по ръцете Ви и да се разпространят.</li>
            <li>Дезинфекцирайте предметите които докосвате, напр.
             дистанционните управления, играчките, дръжките на вратите или масите.
             Микробите могат да живеят там в продължение на часове.
      Не използвайте едни и същи кърпи или чаши, когато някой в дома Ви е болен.</li>
          </ol>
        </Col>
        <Col md={{span:3}}>
          <Image webp={require("../images/food-bag@2x.jpg")} style={{width:'100%'}}/>
          <h3 className="title-red py-4">Три лесни начина да се отнасяте добре към стомаха си</h3>
          <p>Нашата чревна флора е ключът към здрава имунна система. За да я поддържате в  хармония,
          Вие бихте могли:</p>
          <ol>
            <li>Да промените начина си на хранене, като премахнете преработените храни
            и ядете повече от любимите Ви плодове и зеленчуци..</li>
            <li>Опитайте лук, праз лук, целина, артишок, бобови растения и аспарагус.
              Те съдържат растителни фибри, с които могат да се хранят полезните бактерии в червата.</li>
            <li>Приемайте пробиотик, за да помогнете на имунната си система по време на стрес
                 и след прием на антибиотици.</li>
          </ol>
          <p>Ако страдате от храносмилателни смущения, научете повече
          за нашия продукт <a href="http://www.iberogast.bg/">Иберогаст</a> –
            с 9 лечебни растения, които Ви помагат при симптоми на стомашно-чревен дискомфорт,
           подходящ за възрастни и деца над 3 години.</p>

        </Col>
        <Col md={{span:3}}>


          <Image webp={require("../images/redoxon-onion-image.webp")} style={{width:'100%'}}/>
          <h3 className="title-red py-4">Три храни, засилващи имунната система</h3>
          <p>Добавете тези храни към диетата си, за да помогнат на имунната
          Ви система да запази силата си.</p>
          <ol>
            <li>Чесънът се добавя наистина лесно към ястията
               и може да помогне на имунната Ви система да се бори с простудните заболявания
             и други чести болести.</li>
            <li>Киселото мляко е източник на добри бактерии,
               наречени пробиотици, които поддържат храносмилателната и имунната системи в добро здраве.</li>
            <li>Гъбите могат да засилят производството и активността на белите кръвни клетки,
                  които помагат на организма да победи инфекциите.</li>
          </ol>
        </Col>
      </Row>


      <Footer />
    </Container>;
  }
}


export default HowStayHealthy;