import React from 'react';
import Header from './Header';
import Footer from './Footer';
import Image from 'react-image-webp';
import Basketball from "../images/basketball.jpg";
import { Container, Row, Col } from 'react-bootstrap';
import App from './../App.css';


class VitaminC extends React.Component {
    render() {
        return <Container fluid="xl">
            <Header />
            <Row>
                <Col md={{ span: 12 }}>
                    <Image webp={require("../images/berries.webp")} alt="berries" style={{ width: '1263px' }} />
                </Col>
            </Row>
            <Row>
                <Col md={{ span: 6, offset: 4 }}>
                    <h1 className="text-center py-4">Силата на витамин С</h1>

                </Col>
            </Row>
            <Row className="vit-C">
                <Col md={{ span: 3, offset: 2 }}>
                    <Image webp={require("../images/vit_c.webp")} alt="vit_c" style={{ width: '85%', margin: '13%' }} />
                </Col>
                <Col md={{ span: 5 }} className="py-5">
                    <p className="py-5">Витамин С вероятно е най-известният микроелемент.
                     Той помага на организма да поддържа имунната система. Набавяме си го чрез храната,
                     когато приемаме храни, богати на витамин С, като например пресни плодове и зеленчуци.
                     Човешкият организъм  не може да произвежда витамин С или да съхранява големи количества
                      от него, поради което понякога може да е добре да вземем допълнително количество
                      чрез прием на хранителна добавка с  витамин С. Именно с това може да ни помогне Редоксон®*.
                <sup>*- Витамин С подпомага нормалното функциониране на имунната система</sup>
                    </p>
                </Col>

            </Row>
            <Row className="justify-content-center align-items-center">
                <Col md={{ span: 3, offset: 1 }}>
                    <Image webp={require("../images/vit_c_molecole.webp")} style={{ width: '100%'}} />
                </Col>
                <Col md={{ span: 4 }}>
                    <h2 className="py-4">Какво прави витамин С?</h2>
                    <p>Витамин C помага на имунната Ви система да функционира нормално и спомага
                     за намаляване на умората. Като антиоксидант, витамин С допринася и за защитата
                     на Вашите клетки и спомага за тяхната нормална функция. Витамин С помага и за
                     нормалното производство на колаген; колагенът представлява част от структурата
                     на Вашите кости, зъби, венци и кожа. Витамин С играе важна роля в поддържането
                     на тяхното здраве</p>
                </Col>
            </Row>
            <Row>
                <Col md={{ span: 4, offset: 2 }}>
                    <h3 className="py-4">Какво представлява цинкът и защо се нуждая от него?</h3>
                    <p>Цинкът е микроелемент  и  също както витамин С, допринася за нормалното
                         функциониране на имунната система, както и за защита на клетките от
                          оксидативния стрес. Цинкът е необходим и за растежа и развитието. Присъства в
                         множество храни (месо, риба, мляко, млечни и зърнени продукти), както и в някои
                          хранителни добавки. Цинкът има разнообразни функции в тялото, включително
                           допринася за нормалното функциониране на имунната система и деленето на клетките.</p>
                </Col>
                <Col md={{ span: 4 }}>
                    <Image webp={require("../images/periodic_table.webp")} style={{ width: '87%', height: '100%' }} />
                </Col>
            </Row>
            <Row>
                <Col md={{ span: 4 , offset: 2}}>
                    <Image webp={require("../images/glass.webp")} style={{ width: '87%', height: '100%' }} />
                </Col>
                <Col md={{ span: 4 }}>
                    <h3 className="py-4">Защо витамин С и цинк?</h3>
                    <p>В комбинацията от микроелементи Редоксон® витамин С и цинк се допълват взаимно,
                         за да подпомогнат имунната система на Вашия организъм*. Витамин С и цинкът
                        заедно подпомагат нормалното функциониране на кожата, а витамин С спомага
                         за нормалното производство на колаген. Вашата кожа е първата защита на тялото,
                      поради което е важно тя да бъде поддържана здрава!</p>
                    <p>Наред с това, витамин С и цинкът подпомагат другите защити: клетъчното делене
                 и развитие и производството на антитела.<br /><br />
                        <sup>*Витамин C и цинк допринасят за нормалната функция на имунната система.</sup></p>
                </Col>
            </Row>
            <Row className="justify-content-center align-items-center">
                <Col md={{ span: 5, offset: 1 }}>
                    <h3 className="py-4 text-center">Как Редоксон® помага на Вашата имунна система</h3>
                    <p>Тялото Ви е снабдено с мощни естествени защити, а имунната Ви система разполага
                         с множество начини за справяне със заплахите от бактерии и вируси. Можете да
                          приемате допълнителни витамини и минерали, за да поддържате имунната си система.
                           И точно тук се включва  Редоксон®. Нашата гама от продукти с витамин С са
                                разработени, така че да подпомагат имунната Ви система.*</p>
                    <p>Забързаният ни свят на бързо хранене и полу-готови храни, е предизвикателство да
                         приемаме достатъчно количество плодове и зеленчуци, осигуряващи всички витамини
                          и минерали, от които се нуждаем, за да подпомогнем напълно функциите на организма.
                           Недостатъчният прием на витамини и минерали може да се отрази отрицателно върху
                                имунната система и общото здраве.<br /><br /><sup>*-
                                Витамин С подпомага нормалното функциониране на имунната система</sup></p>
                </Col>
                <Col md={{ span: 4}}>
                    <Image webp={require("../images/chemistry.webp")} style={{ width: '100%',height:'80%' }} />
                </Col>
            </Row>
            <Row>
                <Col md={{ span: 12 }}>
                    <img src={Basketball} style={{ width: '1263px', height: '100%' }} />
                </Col>
                
            </Row>
  <Row>
      <Col md={{span:6, offset:3}} className="text-center">
       <h3 className="py-4">Редоксон® подпомага нормалното функциониране на имунната система</h3>
                    <p>Нашата гама продукти за укрепване на имунитета се основава на ползите от
                            витамин С и цинк, подбрани да подкрепят имунната система.* Необходимо е да
                            се грижите за имунната си система. Дори и да не го усещате, имунната система
                             работи 24 часа на ден. Точно както растението се нуждае от вода и светлина, така
                              и имунната система има нужда от редовно хранене, за да поддържа защитните системи
                       на тялото ви.<br /><br /><sup>*Витамините C, A, D, E, B6 и B12, цинк, селен, желязо,
                     мед и фолиева киселина допринасят за нормалната функция на имунната система.</sup></p>
      </Col>
  </Row>

            <Footer />
        </Container>;
    }
}

export default VitaminC;